FKDD_COPY_DIFF_3_2026-02-14/InformationRegisters/ур_ЗаменыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ур_ЗаменыНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>АктуальнаяНоменклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗамененнаяНоменклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/InformationRegisters/Цены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Цены</Name>
			<Comment>Цены</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Comment>Цена</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипЦен</Name>
					<Comment>Тип цен, для которого хранятся цены</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура для которой сохраняются цены</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры для которой сохраняются цены</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Comment>Единица измерения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Поставщик, историю цен которого необходимо хранить. Если &lt;пусто&gt;, то цену установили мы.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/AccumulationRegisters/ПартииТоваровКомпании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ПартииТоваровКомпании</Name>
			<Comment>Блок учета партий товаров компании собственных и принятых на комиссию</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количественный остаток товара на складе в разрезе партий</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма в валюте регламентированного учета с налогами</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма в валюте управленческого учета с налогами</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Comment>Сумма НДС в валюте регламентированного учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>Ставка НДС</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Comment>Проект</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументПродажи</Name>
					<Comment>Документ продажи</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратПоставщикуАвтомобилей</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияАктивов</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионера</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияАвтомобилей</v8:Type>
						<v8:Type>cfg:DocumentRef.Инвентаризация</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеСмены</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераЗаАвтомобили</v8:Type>
						<v8:Type>cfg:DocumentRef.АктРазногласий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СкладКомпании</Name>
					<Comment>Склад компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусПартии</Name>
					<Comment>Статус партии, определяющий, чей товар (купленный компанией или принятый на комиссию)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПартий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Comment>Партия по которой поступил или был взят на комиссию товар</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыПартий</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/CommonModules/ур_Общий/Ext/Module.bsl
//***************
Процедура ур_ЗагрузкаКаталога(Данные, НаДату,ТекБренд) Экспорт
	
	Если СокрЛП(Данные) = "" Тогда 
		Возврат;
	КонецЕсли;        
	
	Попытка
		
		КолвоСтрок=СтрЧислоСтрок(Данные);
		Для Сч = 1 по КолвоСтрок Цикл
			НаДатуВ="";
			ТекСтрока = СтрПолучитьСтроку(Данные, Сч);
			ДатаЗамены = Дата(1,1,1);
			ДлинаТекСтроки = СтрДлина(ТекСтрока);
			Позиция = Найти(ТекСтрока, ";");
			Если Позиция <> 0 Тогда 
				Артикул = Лев(ТекСтрока, Позиция - 1);
				ТекСтрока = Сред(ТекСтрока, Позиция + 1, ДлинаТекСтроки - Позиция);
				ДлинаТекСтроки = СтрДлина(ТекСтрока);
				Позиция = Найти(ТекСтрока, ";");
				Если Позиция <> 0 Тогда
					Наименование = Лев(ТекСтрока, Позиция - 1);
					ТекСтрока = Сред(ТекСтрока, Позиция + 1, ДлинаТекСтроки - Позиция);
					ДлинаТекСтроки = СтрДлина(ТекСтрока);
					Позиция = Найти(ТекСтрока, ";");
					Если Позиция <> 0 Тогда
						НаименованиеИностранное = Лев(ТекСтрока, Позиция - 1);
						ТекСтрока = Сред(ТекСтрока, Позиция + 1, ДлинаТекСтроки - Позиция);
						ДлинаТекСтроки = СтрДлина(ТекСтрока);
						Позиция = Найти(ТекСтрока, ";");
						Если Позиция <> 0 Тогда
							Замена = Лев(ТекСтрока, Позиция - 1);
							ТекСтрока = Сред(ТекСтрока, Позиция + 1, ДлинаТекСтроки - Позиция);
							ДлинаТекСтроки = СтрДлина(ТекСтрока);
							Позиция = Найти(ТекСтрока, ";");
							Если Позиция <> 0 Тогда
								Попытка
									ДатаЗамены = Дата(Число(Сред(ТекСтрока, Позиция - 4, 4)), Число(Сред(ТекСтрока, Позиция - 7, 2)), Число(Лев(ТекСтрока, Позиция - 9)));
								Исключение
									ДатаЗамены = Дата(1,1,1);
								КонецПопытки;        
							КонецЕсли;        
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;        
			
			Если Артикул="" Тогда
				Прервать;
			КонецЕсли;
			
			//проверка на неуникальные записи в каталоге
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ур_КаталогДистрибьютораСрезПоследних.ДатаЗамены,
			|	ур_КаталогДистрибьютораСрезПоследних.Замена,
			|	ур_КаталогДистрибьютораСрезПоследних.НаименованиеИностранное,
			|	ур_КаталогДистрибьютораСрезПоследних.Наименование,
			|	ур_КаталогДистрибьютораСрезПоследних.Бренд,
			|	ур_КаталогДистрибьютораСрезПоследних.Артикул
			|ИЗ
			|	РегистрСведений.ур_КаталогДистрибьютора.СрезПоследних(
			|			&НаДату,
			|			Артикул = &Артикул
			|				И Бренд = &Бренд
			|				И Замена = &Замена) КАК ур_КаталогДистрибьютораСрезПоследних";
			
			Запрос.УстановитьПараметр("Артикул",  Артикул);
			Запрос.УстановитьПараметр("Замена",  Замена);
			Запрос.УстановитьПараметр("Бренд", ТекБренд);
			Запрос.УстановитьПараметр("НаДату", ТекущаяДата());
			
			НаборЗаписей_ = Запрос.Выполнить().Выгрузить();
			Если НаборЗаписей_.Количество() <> 0 Тогда 
             	Продолжить;
			КонецЕсли;

			
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ур_КаталогДистрибьютораСрезПоследних.ДатаЗамены,
			|	ур_КаталогДистрибьютораСрезПоследних.Замена,
			|	ур_КаталогДистрибьютораСрезПоследних.НаименованиеИностранное,
			|	ур_КаталогДистрибьютораСрезПоследних.Наименование,
			|	ур_КаталогДистрибьютораСрезПоследних.Бренд,
			|	ур_КаталогДистрибьютораСрезПоследних.Артикул
			|ИЗ
			|	РегистрСведений.ур_КаталогДистрибьютора.СрезПоследних(
			|			&НаДату,
			|			Артикул = &Артикул
			|				И Бренд = &Бренд) КАК ур_КаталогДистрибьютораСрезПоследних";
			
			Запрос.УстановитьПараметр("Артикул",  Замена);
			Запрос.УстановитьПараметр("Бренд", ТекБренд);
			Запрос.УстановитьПараметр("НаДату", НаДату);
			
			НаборЗаписей_ = Запрос.Выполнить().Выгрузить();
			Если НаборЗаписей_.Количество() <> 0 Тогда 
				ТекЗапись = НаборЗаписей_[НаборЗаписей_.Количество()-1];
				
				
			//ОтборРег = Новый Структура;
			//ОтборРег.Вставить("Артикул", Артикул);
			//ОтборРег.Вставить("Бренд", ТекБренд);
			//НаборЗаписей_=РегистрыСведений.ур_КаталогДистрибьютора.СрезПоследних(НаДату, ОтборРег);
			//Если НаборЗаписей_.Количество() <> 0 Тогда 
			//	ТекЗапись = НаборЗаписей_[НаборЗаписей_.Количество()-1];
				//ТекЗапись=НаборЗаписей_;
				Если ТекЗапись.Артикул = Артикул И ТекЗапись.Наименование = Наименование И ТекЗапись.НаименованиеИностранное = НаименованиеИностранное И ТекЗапись.Замена = Замена Тогда 
					Продолжить;
					//Множественная замена, первая загрузка полного каталога, для того, чтобы не нарушалась уникальность периода
				ИначеЕсли ТекЗапись.Артикул = Артикул И ТекЗапись.Наименование = Наименование И ТекЗапись.НаименованиеИностранное = НаименованиеИностранное И ТекЗапись.Замена <> Замена Тогда
					НаДатуВ=ДобавитьМесяц(НаДату,Секунда(ТекущаяДата()));
				КонецЕсли;
			КонецЕсли;
			
				НаборЗаписейКД = РегистрыСведений.ур_КаталогДистрибьютора.СоздатьНаборЗаписей();
				НаборЗаписейКД.Отбор.Артикул.Установить(Артикул);
				НаборЗаписейКД.Отбор.Бренд.Установить(ТекБренд);
				НаборЗаписейКД.Прочитать();
				Если НаборЗаписейКД.Количество()>0 тогда
					НаДатуВ=ДобавитьМесяц(НаДату,Секунда(ТекущаяДата()));
				КонецЕсли;
				НоваяЗапись = НаборЗаписейКД.Добавить();
				Если НаДатуВ="" Тогда
					НоваяЗапись.Период = НаДату;
				Иначе
					НоваяЗапись.Период = НаДатуВ;
				КонецЕсли;
				НоваяЗапись.Артикул = Артикул;
				НоваяЗапись.Наименование = Наименование;
				НоваяЗапись.НаименованиеИностранное = НаименованиеИностранное;
				НоваяЗапись.Замена = Замена;
				НоваяЗапись.ДатаЗамены = ДатаЗамены;
				НоваяЗапись.Бренд=ТекБренд;
				НаборЗаписейКД.Записать();
			КонецЦикла;
			
		Исключение
			ЗаписьЖурналаРегистрации("HTTPСоединение", УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки());
			Возврат;
		КонецПопытки;
		
		//Обработка замен
		Попытка
			
			ТЗКаталог = РегистрыСведений.ур_КаталогДистрибьютора.СоздатьНаборЗаписей();
			ТЗКаталог.Прочитать();
			Для Каждого ТекСтрока Из ТЗКаталог Цикл
				
				Замена = ТекСтрока.Замена;
				Артикул = ТекСтрока.Артикул;
				
				Если Замена <> "" Тогда
					
					НоменклатураИсточник = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул", Замена);
					НоменклатураПриемник = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул", Артикул);
					
					Если НоменклатураИсточник <> Справочники.Номенклатура.ПустаяСсылка() И НоменклатураПриемник <> Справочники.Номенклатура.ПустаяСсылка() Тогда // И Замена <> "" Тогда 
						Если НоменклатураИсточник.ПометкаУдаления = Ложь И НоменклатураПриемник.ПометкаУдаления = Ложь Тогда 
							ОтказЗамены = Ложь;
							ТекущиеЗамены = НетЗамен(НоменклатураПриемник);
							Пока ТекущиеЗамены.Количество() <> 0 Цикл
								Если ТекущиеЗамены[0].АктуальнаяНоменклатура = НоменклатураИсточник Тогда 
									ОтказЗамены = Истина;
									Прервать;
								КонецЕсли;
								НоменклатураПриемник = ТекущиеЗамены[0].АктуальнаяНоменклатура;
								ТекущиеЗамены = НетЗамен(НоменклатураПриемник);
							КонецЦикла;        
							Если НЕ ОтказЗамены Тогда 
								АктуальнаяНоменклатура = ПроверкаНаБолееАктуальную(НоменклатураИсточник);
								Если АктуальнаяНоменклатура <> НоменклатураПриемник Тогда 
									НоменклатураИсточник = АктуальнаяНоменклатура;
								КонецЕсли;
								
								НаборЗаписей=РегистрыСведений.ур_ЗаменыНоменклатуры.СоздатьНаборЗаписей();
								НаборЗаписей.Отбор.АктуальнаяНоменклатура.Установить(НоменклатураИсточник);
								НаборЗаписей.Отбор.ЗамененнаяНоменклатура.Установить(НоменклатураПриемник);
								НаборЗаписей.Прочитать();
								НаборЗаписей.Очистить();
								
								НоваяЗапись=НаборЗаписей.Добавить();
								НоваяЗапись.АктуальнаяНоменклатура = НоменклатураИсточник;
								НоваяЗапись.ЗамененнаяНоменклатура = НоменклатураПриемник;
								НоваяЗапись.ДатаИзменения = ТекСтрока.ДатаЗамены;
								НоваяЗапись.Ответственный = ПараметрыСеанса.Пользователь;
								НаборЗаписей.Записать();
								
								
								// если есть замены на приемнике, то переносим
								
								НаборЗаписейПриемник=РегистрыСведений.ур_ЗаменыНоменклатуры.СоздатьНаборЗаписей();
								НаборЗаписейПриемник.Отбор.АктуальнаяНоменклатура.Установить(НоменклатураПриемник);
								НаборЗаписейПриемник.Прочитать();
								
								Для каждого СтрокаНабора Из НаборЗаписейПриемник Цикл
									Если НоменклатураИсточник=СтрокаНабора.ЗамененнаяНоменклатура Тогда
										Продолжить;
									КонецЕсли;
									НаборЗаписейПроверкаНаДубли=РегистрыСведений.ур_ЗаменыНоменклатуры.СоздатьНаборЗаписей();
									НаборЗаписейПроверкаНаДубли.Отбор.АктуальнаяНоменклатура.Установить(НоменклатураИсточник);
									НаборЗаписейПроверкаНаДубли.Отбор.ЗамененнаяНоменклатура.Установить(СтрокаНабора.ЗамененнаяНоменклатура);
									НаборЗаписейПроверкаНаДубли.Прочитать();
									Если НаборЗаписейПроверкаНаДубли.Количество()>0 Тогда
										НаборЗаписейПроверкаНаДубли.Очистить();
									КонецЕсли;
									НаборЗаписейПроверкаНаДубли.Записать();
									
									НаборЗаписейЗамена=РегистрыСведений.ур_ЗаменыНоменклатуры.СоздатьНаборЗаписей();
									НаборЗаписейЗамена.Отбор.АктуальнаяНоменклатура.Установить(НоменклатураИсточник);
									НаборЗаписейЗамена.Прочитать();
									НоваяЗапись=НаборЗаписейЗамена.Добавить();
									НоваяЗапись.АктуальнаяНоменклатура=НоменклатураИсточник;
									НоваяЗапись.ЗамененнаяНоменклатура=СтрокаНабора.ЗамененнаяНоменклатура;
									НоваяЗапись.ДатаИзменения=СтрокаНабора.ДатаИзменения;
									НоваяЗапись.Ответственный=СтрокаНабора.Ответственный;
									НаборЗаписейЗамена.Записать();
									
								КонецЦикла;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
		Исключение
			ЗаписьЖурналаРегистрации("ОбработкаЗамен", УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки());
			Возврат;
		КонецПопытки;
		
	КонецПроцедуры
	//***************
	
	Функция НетЗамен(ЗамененнаяНоменклатура)
		
		Записи = РегистрыСведений.ур_ЗаменыНоменклатуры.СоздатьНаборЗаписей();
		Записи.Отбор.ЗамененнаяНоменклатура.Установить(ЗамененнаяНоменклатура);	
		Записи.Прочитать();
		
		Возврат Записи;//.Количество() = 0);
		
	КонецФункции
	
	Функция ПроверкаНаБолееАктуальную(Номенклатура)
		
		Записи = РегистрыСведений.ур_ЗаменыНоменклатуры.СоздатьНаборЗаписей();
		Записи.Отбор.ЗамененнаяНоменклатура.Установить(Номенклатура);	
		Записи.Прочитать();
		Если Записи.Количество() > 0 Тогда
			Возврат Записи[0].АктуальнаяНоменклатура;
		Иначе
			Возврат Номенклатура;
		КонецЕсли;
		
	КонецФункции
	
	Процедура ур_ПолучениеКаталогаДистрибьютора(Параметры = Неопределено) Экспорт
		
		
		//первый старт
		Записи = РегистрыСведений.ур_КаталогДистрибьютора;
		НаборЗаписей = Записи.СоздатьНаборЗаписей();
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() = 0 Тогда
			НаДату = "";
		Иначе
			НаДату=КонецДня(НачалоДня(ТекущаяДата())-1);
		КонецЕсли;
		
		Выборка=Справочники.ур_БрендыСиУС.Выбрать();	 //последоветальное получение адресов по брендам дилера
		Пока Выборка.Следующий() Цикл
			ТекБренд=Выборка.Ссылка;
			//проверка активной настройки
			Настройка=Справочники.ур_НастройкиDMS.НайтиПоРеквизиту("Бренд",ТекБренд);
			Если НЕ Настройка.НастройкаАктивна Тогда Продолжить; КонецЕсли;
			Данные= ур_ОтправкаПолучениеДанных("item-and-replacement",Формат(НаДату,"ДФ=ггггММдд"),ТекБренд);
			Если Данные="нет изменений" Тогда
				//нет изменений, ок
			ИначеЕсли Данные="ошибка обмена" ИЛИ Найти(Данные,"SQL Server")>0 ИЛИ Найти(Данные,"ошибка")>0 Тогда
				//ну да, ошибка, ошибку выдал в строку или записал в журнал регистрации
			Иначе
				Если НаДату="" Тогда
					НаДату=Дата(1900,1,1);
				КонецЕсли;
				ур_ЗагрузкаКаталога(Данные, НаДату,ТекБренд);
			КонецЕсли;
		    ЗаписьЖурналаРегистрации("СиУС", УровеньЖурналаРегистрации.Информация, , , "ур_ПолучениеКаталогаДистрибьютора завершена "+ТекБренд);
		КонецЦикла;
	КонецПроцедуры
	
	Функция ПреобразованиеДанныхДляОбмена(ТипДанныхПреобразования,Данные)
		Если ТипДанныхПреобразования="Строка" Тогда  //поиск и замена ";" на _ т.к. формат csv
			Возврат СтрЗаменить(Данные,";","_");
		ИначеЕсли ТипДанныхПреобразования="Число" Тогда  //формат чисел SQL с разделителем - точкой, в 1С - запятая
			Возврат СтрЗаменить(Данные,",",".");
		КонецЕсли;
	КонецФункции
	
	Функция ур_СтатистическиеДанные(ТекБренд) Экспорт
		
		НастройкиТекущегоБренда=Справочники.ур_НастройкиDMS.НайтиПоРеквизиту("Бренд",ТекБренд);
		ТаблицаСоответствийАртикулов=Новый ТаблицаЗначений;
		ТаблицаСоответствийАртикулов.Колонки.Добавить("Номенклатура");
		ТаблицаСоответствийАртикулов.Колонки.Добавить("АртикулНоменклатуры");
		ТаблицаСоответствийАртикулов.Колонки.Добавить("АртикулВКаталоге");
		
		//++подготовка таблицы соответствий для артикулов с "-".
		Запрос = Новый Запрос;
		Запрос.Текст =                            
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ур_КаталогДистрибьютораСрезПоследних.Артикул КАК Артикул
		|ИЗ
		|	РегистрСведений.ур_КаталогДистрибьютора.СрезПоследних(&Дата, Бренд = &Бренд) КАК ур_КаталогДистрибьютораСрезПоследних";
		
		Запрос.УстановитьПараметр("Дата", ТекущаяДата());
		Запрос.УстановитьПараметр("Бренд", ТекБренд);
		
		Результат = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = Результат.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			ПромСтрока=ВыборкаДетальныеЗаписи.Артикул;
			АртикулПоиска="";
			Для Цкл=1 По СтрДлина(ПромСтрока) Цикл
				АртикулПоиска=АртикулПоиска+"%"+Сред(ПромСтрока,Цкл,1);
			КонецЦикла;
			
			
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	Номенклатура.Ссылка,
			|	Номенклатура.Артикул
			|ИЗ
			|	Справочник.Номенклатура КАК Номенклатура
			|ГДЕ
			|	Номенклатура.Артикул ПОДОБНО &Артикул";
			
			Запрос.УстановитьПараметр("Артикул", АртикулПоиска);
			
			Результат2 = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи2 = Результат2.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи2.Следующий() Цикл
				// Вставить обработку выборки ВыборкаДетальныеЗаписи
				Аналог=ТаблицаСоответствийАртикулов.Добавить();
				Аналог.Номенклатура=ВыборкаДетальныеЗаписи2.Ссылка;
				Аналог.АртикулВКаталоге=ПромСтрока;
				Аналог.АртикулНоменклатуры=ВыборкаДетальныеЗаписи2.Артикул;
			КонецЦикла;
			
			
		КонецЦикла;
		
		ТаблицаНоменклатурыПоиска=ТаблицаСоответствийАртикулов.ВыгрузитьКолонку("Номенклатура");	
		
		
		ЗначениеОбмена = Новый Массив;
		Склады=Справочники.СкладыКомпании.ПустаяСсылка();
		//KamikadZe begin add 28.11.2016 17:10:56
		Склады=Справочники.ур_НастройкиDMS.ОсновнаяНастройка.СкладыДляИсключения[0].Склад;
		//KamikadZe end add
		
		//таблица location
		ТЗСклады = Новый ТаблицаЗначений;
		ТЗСклады.Колонки.Добавить("ИдентификаторСкладаДилера", Новый ОписаниеТипов("Строка"));
		ТЗСклады.Колонки.Добавить("НазваниеСкладаДилера", Новый ОписаниеТипов("Строка"));
		ТЗСклады.Колонки.Добавить("Город", Новый ОписаниеТипов("Строка"));
		ТЗСклады.Колонки.Добавить("Адрес", Новый ОписаниеТипов("Строка"));
		ТЗСклады.Колонки.Добавить("Телефон", Новый ОписаниеТипов("Строка"));
		ТЗСклады.Колонки.Добавить("Исключение", Новый ОписаниеТипов("Число"));
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	СкладыКомпании.Код,
		|	СкладыКомпании.Наименование КАК Наименование,
		|	Адрес.КраткоеПредставление КАК Адрес,
		|	Телефон.КраткоеПредставление КАК Телефон,
		|	СкладыКомпании.Ссылка
		|ИЗ
		|	Справочник.СкладыКомпании КАК СкладыКомпании
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			КонтактнаяИнформация.Объект КАК Объект,
		|			КонтактнаяИнформация.Тип КАК Тип,
		|			КонтактнаяИнформация.Вид КАК Вид,
		|			КонтактнаяИнформация.Представление КАК КраткоеПредставление
		|		ИЗ
		|			РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|		ГДЕ
		|			КонтактнаяИнформация.Тип = &Тип
		|			И КонтактнаяИнформация.Вид = &Вид) КАК Адрес
		|		ПО СкладыКомпании.Организация = Адрес.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			КонтактнаяИнформация.Объект КАК Объект,
		|			КонтактнаяИнформация.Тип КАК Тип,
		|			КонтактнаяИнформация.Вид КАК Вид,
		|			КонтактнаяИнформация.Представление КАК КраткоеПредставление
		|		ИЗ
		|			РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|		ГДЕ
		|			КонтактнаяИнформация.Тип = &Тип2
		|			И КонтактнаяИнформация.Вид = &Вид2) КАК Телефон
		|		ПО СкладыКомпании.Организация = Телефон.Объект
		|ГДЕ
//		|	(НЕ СкладыКомпании.Ссылка В (&Склады))
		//KamikadZe begin add 28.11.2016 17:13:17
		|	(СкладыКомпании.Ссылка В (&Склады))
		//KamikadZe end add
		|	И СкладыКомпании.ЭтоГруппа = ЛОЖЬ
		|	И СкладыКомпании.ПометкаУдаления = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Наименование
		|АВТОУПОРЯДОЧИВАНИЕ";
		
		Запрос.УстановитьПараметр("Склады", Склады);
		Запрос.УстановитьПараметр("Вид", Справочники.ВидыКонтактнойИнформации.АдресФактический);
		Запрос.УстановитьПараметр("Вид2", Справочники.ВидыКонтактнойИнформации.ТелефонРабочий);
		Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.Адрес);
		Запрос.УстановитьПараметр("Тип2", Перечисления.ТипыКонтактнойИнформации.Телефон);
		РезультатСклады = Запрос.Выполнить().Выгрузить();
		
		
		Для Каждого ТекСтрокаСклады Из РезультатСклады Цикл
			НоваяСтрока = ТЗСклады.Добавить();
			НоваяСтрока.ИдентификаторСкладаДилера = ПреобразованиеДанныхДляОбмена("Строка",ТекСтрокаСклады.Код);
			НоваяСтрока.НазваниеСкладаДилера = ПреобразованиеДанныхДляОбмена("Строка",ТекСтрокаСклады.Наименование);
			Город = ТекСтрокаСклады.Адрес;
			СимволГород = Найти(Город, "г");
			Город = Лев(Город, СимволГород-1);
			Запятая = Найти(Город, ",");
			Пока Запятая <> 0 Цикл
				Город = Сред(Город, Запятая+2, СтрДлина(Город)-Запятая);
				Запятая = Найти(Город, ",");
			КонецЦикла;
			НоваяСтрока.Город = ПреобразованиеДанныхДляОбмена("Строка", Город);
			Телефон = ТекСтрокаСклады.Телефон;
			Запятая = Найти(Телефон, ",");
			Телефон = Лев(Телефон, Запятая-1);
			НоваяСтрока.Телефон = ПреобразованиеДанныхДляОбмена("Строка", Телефон);
			НоваяСтрока.Адрес = ПреобразованиеДанныхДляОбмена("Строка", ТекСтрокаСклады.Адрес);
			
			
			Найден=НастройкиТекущегоБренда.СкладыДляИсключения.Найти(ТекСтрокаСклады.Ссылка,"Склад");
			//Найден=Справочники.ур_НастройкиDMS.ОсновнаяНастройка.СкладыДляИсключения.Найти(ТекСтрокаСклады.Ссылка,"Склад");
			Если Найден=Неопределено Тогда
				НоваяСтрока.Исключение=0;
				//KamikadZe begin add 28.11.2016 17:14:10
				НоваяСтрока.Исключение=1;
				//KamikadZe end add
			Иначе
				НоваяСтрока.Исключение=1;
				//KamikadZe begin add 28.11.2016 17:14:10
				НоваяСтрока.Исключение=0;
				//KamikadZe end add
			КонецЕсли;
			
		КонецЦикла;
		
		ЗначениеОбмена.Добавить(ТЗСклады);
		
		//таблица user-price
		ТЗЦены = Новый ТаблицаЗначений;
		ТЗЦены.Колонки.Добавить("ИдентификаторСкладаДилера", Новый ОписаниеТипов("Строка"));
		ТЗЦены.Колонки.Добавить("АртикулЗЧ", Новый ОписаниеТипов("Строка"));
		ТЗЦены.Колонки.Добавить("СтоимостьДляКонечногоПокупателяВРублях", Новый ОписаниеТипов("Строка"));
		ТЗЦены.Колонки.Добавить("ДатаНачалаДействияЦены", Новый ОписаниеТипов("Строка"));
		
		//МассивПодразделений = Справочники.ур_НастройкиDMS.ОсновнаяНастройка.ПодразделенияДляЦен.ВыгрузитьКолонку("Подразделения");
		МассивПодразделений = НастройкиТекущегоБренда.ПодразделенияДляЦен.ВыгрузитьКолонку("Подразделения");
		Если МассивПодразделений.Количество() = 0 Тогда 
			ВыборкаПодразделений = Справочники.ПодразделенияКомпании.Выбрать();
			Пока ВыборкаПодразделений.Следующий() Цикл
				МассивПодразделений.Добавить(ВыборкаПодразделений.Ссылка);
			КонецЦикла;
		КонецЕсли;	
		//МассивКонтрагентов = Справочники.ур_НастройкиDMS.ОсновнаяНастройка.КонтрагентыДляЦен.ВыгрузитьКолонку("Контрагенты");
		МассивКонтрагентов = НастройкиТекущегоБренда.КонтрагентыДляЦен.ВыгрузитьКолонку("Контрагенты");
		Если МассивКонтрагентов.Количество() = 0 Тогда 
			ВыборкаКонтрагентов = Справочники.Контрагенты.Выбрать();
			Пока ВыборкаКонтрагентов.Следующий() Цикл
				МассивКонтрагентов.Добавить(ВыборкаКонтрагентов.Ссылка);
			КонецЦикла;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ВложенныйЗапрос1.Номенклатура.Артикул КАК Артикул,
		|	МАКСИМУМ(ВложенныйЗапрос1.Цена) КАК Цена,
		|	МАКСИМУМ(ВложенныйЗапрос.Период) КАК Период
		|ИЗ
		|	(ВЫБРАТЬ
		|		ЦеныСрезПоследних.Номенклатура КАК Номенклатура,
		|		СРЕДНЕЕ(ЦеныСрезПоследних.Цена) КАК Цена
		|	ИЗ
		|		РегистрСведений.Цены.СрезПоследних(
		|				&Дата,
		|				ТипЦен = &ТипЦен
		|					И Номенклатура В (&ТЗНоменклатуры)
		|					И ПодразделениеКомпании В (&МассивПодразделений)
		|					И Контрагент В (&МассивКонтрагентов)) КАК ЦеныСрезПоследних
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ЦеныСрезПоследних.Номенклатура) КАК ВложенныйЗапрос1
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ЦеныСрезПоследних.Номенклатура КАК Номенклатура,
		|			МАКСИМУМ(ЦеныСрезПоследних.Период) КАК Период
		|		ИЗ
		|			РегистрСведений.Цены.СрезПоследних(
		|					&Дата,
		|					ТипЦен = &ТипЦен
		|						И Номенклатура В (&ТЗНоменклатуры)
		|						И ПодразделениеКомпании В (&МассивПодразделений)
		|						И Контрагент В (&МассивКонтрагентов)) КАК ЦеныСрезПоследних
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ЦеныСрезПоследних.Номенклатура) КАК ВложенныйЗапрос
		|		ПО ВложенныйЗапрос1.Номенклатура = ВложенныйЗапрос.Номенклатура
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос1.Номенклатура.Артикул
		|
		|УПОРЯДОЧИТЬ ПО
		|	Артикул
		|АВТОУПОРЯДОЧИВАНИЕ";
		
		//Запрос.УстановитьПараметр("Дата", ТекущаяДата());
		//Запрос.УстановитьПараметр("Период", ТекущаяДата());
		Запрос.УстановитьПараметр("Дата", КонецДня(НачалоДня(ТекущаяДата())-1));	
		Запрос.УстановитьПараметр("Период", КонецДня(НачалоДня(ТекущаяДата())-1));	
		
		Запрос.УстановитьПараметр("ТипЦен", Справочники.ур_НастройкиDMS.ОсновнаяНастройка.ТипЦен);
		Запрос.УстановитьПараметр("МассивПодразделений", МассивПодразделений);
		Запрос.УстановитьПараметр("МассивКонтрагентов", МассивКонтрагентов);
		Запрос.УстановитьПараметр("ТЗНоменклатуры", ТаблицаНоменклатурыПоиска);
		
		РезультатЦены = запрос.Выполнить().Выгрузить();
		
		Для Каждого ТекСтрокаЦены Из РезультатЦены Цикл
			НоваяСтрока = ТЗЦены.Добавить();
			//переброска на артикул без тире
			СоответствиеАртикула=ТаблицаСоответствийАртикулов.Найти(ТекСтрокаЦены.Артикул,"АртикулНоменклатуры");
			Если НЕ СоответствиеАртикула=Неопределено Тогда
				НоваяСтрока.АртикулЗЧ = ПреобразованиеДанныхДляОбмена("Строка",СокрЛП(СоответствиеАртикула.АртикулВКаталоге));	
			Иначе
				НоваяСтрока.АртикулЗЧ = ПреобразованиеДанныхДляОбмена("Строка",СокрЛП(ТекСтрокаЦены.Артикул));
			КонецЕсли;
			//НоваяСтрока.АртикулЗЧ = ПреобразованиеДанныхДляОбмена("Строка",СокрЛП(ТекСтрокаЦены.Артикул));
			НоваяСтрока.СтоимостьДляКонечногоПокупателяВРублях = ПреобразованиеДанныхДляОбмена("Число",СтрЗаменить(Строка(ТекСтрокаЦены.Цена)," ",""));
			НоваяСтрока.ДатаНачалаДействияЦены = Формат(ТекСтрокаЦены.Период, "ДФ=yyyyMMdd");
		КонецЦикла;
		
		ЗначениеОбмена.Добавить(ТЗЦены); //" "
		
		//таблица vendor
		ТЗПоставщики = Новый ТаблицаЗначений;
		ТЗПоставщики.Колонки.Добавить("ПоставщикКод", Новый ОписаниеТипов("Строка"));
		ТЗПоставщики.Колонки.Добавить("ПоставщикИмя", Новый ОписаниеТипов("Строка"));
		
		//таблица remained-item
		ТЗОстатки = Новый ТаблицаЗначений;
		ТЗОстатки.Колонки.Добавить("ИдентификаторСкладаДилера", Новый ОписаниеТипов("Строка"));
		ТЗОстатки.Колонки.Добавить("ПоставщикКод", Новый ОписаниеТипов("Строка"));
		ТЗОстатки.Колонки.Добавить("ПоставщикИмя", Новый ОписаниеТипов("Строка"));
		ТЗОстатки.Колонки.Добавить("АртикулЗЧ", Новый ОписаниеТипов("Строка"));
		ТЗОстатки.Колонки.Добавить("Количество", Новый ОписаниеТипов("Строка"));
		ТЗОстатки.Колонки.Добавить("ДатаПоступления", Новый ОписаниеТипов("Строка"));
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПартииТоваровКомпанииОстатки.СкладКомпании.Код КАК Склад,
		|	ПартииТоваровКомпанииОстатки.Номенклатура.Артикул КАК Артикул,
		|	СУММА(ПартииТоваровКомпанииОстатки.КоличествоОстаток) КАК Остаток,
		|	ПартииТоваровКомпанииОстатки.Партия.Дата КАК Дата,
		|	ПартииТоваровКомпанииОстатки.Партия.Контрагент.Код КАК КонтрагентКод,
		|	ПартииТоваровКомпанииОстатки.Партия.Контрагент.Наименование КАК КонтрагентИмя,
		|	ПартииТоваровКомпанииОстатки.СкладКомпании,
		|	ПартииТоваровКомпанииОстатки.Номенклатура,
		|	ПартииТоваровКомпанииОстатки.СтатусПартии
		|ИЗ
		|	РегистрНакопления.ПартииТоваровКомпании.Остатки(
		|			&Дата,
//		|			НЕ СкладКомпании В (&Склады)
//KamikadZe begin add 28.11.2016 17:15:00
		|			СкладКомпании В (&Склады)
//KamikadZe end add
		|				И Номенклатура В (&ТЗНоменклатуры)) КАК ПартииТоваровКомпанииОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ПартииТоваровКомпанииОстатки.Партия.Контрагент.Код,
		|	ПартииТоваровКомпанииОстатки.Партия.Дата,
		|	ПартииТоваровКомпанииОстатки.Номенклатура.Артикул,
		|	ПартииТоваровКомпанииОстатки.Партия.Контрагент.Наименование,
		|	ПартииТоваровКомпанииОстатки.СкладКомпании.Код,
		|	ПартииТоваровКомпанииОстатки.СкладКомпании,
		|	ПартииТоваровКомпанииОстатки.Номенклатура,
		|	ПартииТоваровКомпанииОстатки.СтатусПартии
		|
		|УПОРЯДОЧИТЬ ПО
		|	Склад,
		|	Артикул,
		|	Дата
		|АВТОУПОРЯДОЧИВАНИЕ";
		
		Запрос.УстановитьПараметр("Дата", КонецДня(НачалоДня(ТекущаяДата())-1)); //за прошлую дату
		Запрос.УстановитьПараметр("Склады", Склады);
		Запрос.УстановитьПараметр("ТЗНоменклатуры", ТаблицаНоменклатурыПоиска);
		РезультатОстатки = Запрос.Выполнить().Выгрузить();
		
		// { VIV 04.09.2013
		СтратегияСписанияПартийТоваровПоДатам=Константы.СтратегияСписанияПартийТоваровПоДатам.Получить();
		МетодСписанияФИФО=СтратегияСписанияПартийТоваровПоДатам=Перечисления.СтратегияСписанияПартийТоваровПоДатам.ФИФО;
		// } VIV
		
		Для Каждого ТекСтрокаОстатки Из РезультатОстатки Цикл
			// { VIV 04.09.2013
			Если ?(ЗначениеЗаполнено(ТекСтрокаОстатки.Остаток),ТекСтрокаОстатки.Остаток,0)<=0 Тогда
				Продолжить;
			КонецЕсли;
			// } VIV
			
			НоваяСтрока = ТЗОстатки.Добавить();
			НоваяСтрока.ИдентификаторСкладаДилера = ПреобразованиеДанныхДляОбмена("Строка",ТекСтрокаОстатки.Склад);
			НоваяСтрока.ПоставщикКод = ПреобразованиеДанныхДляОбмена("Строка",ТекСтрокаОстатки.КонтрагентКод);
			НоваяСтрока.ПоставщикИмя = ПреобразованиеДанныхДляОбмена("Строка",ТекСтрокаОстатки.КонтрагентИмя);
			//НоваяСтрока.АртикулЗЧ = ПреобразованиеДанныхДляОбмена("Строка",СокрЛП(ТекСтрокаОстатки.Артикул));
			//переброска на артикул без тире
			СоответствиеАртикула=ТаблицаСоответствийАртикулов.Найти(ТекСтрокаОстатки.Артикул,"АртикулНоменклатуры");
			Если НЕ СоответствиеАртикула=Неопределено Тогда
				НоваяСтрока.АртикулЗЧ = ПреобразованиеДанныхДляОбмена("Строка",СокрЛП(СоответствиеАртикула.АртикулВКаталоге));	
			Иначе
				НоваяСтрока.АртикулЗЧ = ПреобразованиеДанныхДляОбмена("Строка",СокрЛП(ТекСтрокаОстатки.Артикул));
			КонецЕсли;
			
			
			НоваяСтрока.Количество = ПреобразованиеДанныхДляОбмена("Число",СтрЗаменить(Строка(Окр(ТекСтрокаОстатки.Остаток))," ",""));
			НоваяСтрока.ДатаПоступления = Формат(ТекСтрокаОстатки.Дата, "ДФ=yyyyMMdd");
			// { VIV 04.09.2013
			// получаем остатки по последним поступлениям
			Если МетодСписанияФИФО<>Истина Тогда
				НеУчтенныйОстаток=?(ЗначениеЗаполнено(ТекСтрокаОстатки.Остаток), ТекСтрокаОстатки.Остаток, 0);
				
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				|	СУММА(ПартииТоваровКомпанииОбороты.КоличествоПриход) КАК КоличествоПриход,
				|	ПартииТоваровКомпанииОбороты.Период КАК Период,
				|	ПартииТоваровКомпанииОбороты.Регистратор.Контрагент.Код КАК КонтрагентКод,
				|	ПартииТоваровКомпанииОбороты.Регистратор.Контрагент.Наименование КАК КонтрагентИмя
				|ИЗ
				|	РегистрНакопления.ПартииТоваровКомпании.Обороты(
				|			,
				|			,
				|			Регистратор,
				|			СкладКомпании = &СкладКомпании
				|				И Номенклатура = &Номенклатура
				|				И СтатусПартии = &СтатусПартии) КАК ПартииТоваровКомпанииОбороты
				|
				|СГРУППИРОВАТЬ ПО
				|	ПартииТоваровКомпанииОбороты.Период,
				|	ПартииТоваровКомпанииОбороты.Регистратор.Контрагент.Код,
				|	ПартииТоваровКомпанииОбороты.Регистратор.Контрагент.Наименование
				|
				|УПОРЯДОЧИТЬ ПО
				|	Период УБЫВ";
				//
				//			Запрос.Текст = "ВЫБРАТЬ
				//|	СУММА(ПартииТоваровКомпанииОбороты.КоличествоПриход) КАК КоличествоПриход,
				//|	ПартииТоваровКомпанииОбороты.Период КАК Период,
				//|	ПартииТоваровКомпанииОбороты.Партия.Контрагент.Код КАК КонтрагентКод,
				//|	ПартииТоваровКомпанииОбороты.Партия.Контрагент.Наименование КАК КонтрагентИмя
				//|ИЗ
				//|	РегистрНакопления.ПартииТоваровКомпании.Обороты(
				//|			,
				//|			,
				//|			Регистратор,
				//|			СкладКомпании = &СкладКомпании
				//|				И Номенклатура = &Номенклатура
				//|				И СтатусПартии = &СтатусПартии) КАК ПартииТоваровКомпанииОбороты
				//|
				//|СГРУППИРОВАТЬ ПО
				//|	ПартииТоваровКомпанииОбороты.Период,
				//|	ПартииТоваровКомпанииОбороты.Партия.Контрагент.Код,
				//|	ПартииТоваровКомпанииОбороты.Партия.Контрагент.Наименование
				//|
				//|УПОРЯДОЧИТЬ ПО
				//|	Период УБЫВ";
				
				Запрос.УстановитьПараметр("СкладКомпании", ТекСтрокаОстатки.СкладКомпании);
				Запрос.УстановитьПараметр("Номенклатура", ТекСтрокаОстатки.Номенклатура);
				Запрос.УстановитьПараметр("СтатусПартии", ТекСтрокаОстатки.СтатусПартии);
				
				Результат=Запрос.Выполнить();
				Выборка = Результат.Выбрать();
				Пока Выборка.Следующий() Цикл
					КоличествоПоступление= ?(ЗначениеЗаполнено(Выборка.КоличествоПриход), Выборка.КоличествоПриход, 0);
					КоличествоВТаблицу=Мин(НеУчтенныйОстаток, КоличествоПоступление);
					
					//НоваяСтрока.Количество=КоличествоВТаблицу;
					НоваяСтрока.Количество=ПреобразованиеДанныхДляОбмена("Число",СтрЗаменить(Строка(Окр(КоличествоВТаблицу))," ",""));
					//НоваяСтрока.ПоставщикКод=Выборка.КонтрагентКод;
					НоваяСтрока.ПоставщикКод=ПреобразованиеДанныхДляОбмена("Строка",Выборка.КонтрагентКод);
					НоваяСтрока.ПоставщикИмя=ПреобразованиеДанныхДляОбмена("Строка",Выборка.КонтрагентИмя);
					//НоваяСтрока.ПоставщикИмя=Выборка.КонтрагентИмя;
					//	НоваяСтрока.ДатаПоступления=Выборка.Период;
					НоваяСтрока.ДатаПоступления=Формат(Выборка.Период,"ДФ=yyyyMMdd");
					
					НеУчтенныйОстаток=НеУчтенныйОстаток-КоличествоПоступление;
					Если НеУчтенныйОстаток<=0 Тогда
						Прервать;
					КонецЕсли;
					
					// осталось количество, добавим новую строку
					НоваяСтрокаДоп = ТЗОстатки.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрокаДоп, НоваяСтрока);
					НоваяСтрокаДоп.Количество=0;
					НоваяСтрокаДоп.ПоставщикИмя="";
					НоваяСтрокаДоп.ПоставщикКод="";
					НоваяСтрокаДоп.ДатаПоступления='00010101';
					НоваяСтрока=НоваяСтрокаДоп;
					
				КонецЦикла;
			КонецЕсли;
			// } VIV				
		КонецЦикла;
		
		РезультатОстатки=ТЗОстатки.Скопировать();
		РезультатОстатки.Свернуть("ПоставщикКод, ПоставщикИмя");
		Для Каждого ТекСтрокаСписок Из РезультатОстатки Цикл
			Если ТекСтрокаСписок.ПоставщикКод <> "" И ТекСтрокаСписок.ПоставщикИмя <> Null Тогда 
				НоваяСтрока = ТЗПоставщики.Добавить();
				НоваяСтрока.ПоставщикКод = ПреобразованиеДанныхДляОбмена("Строка",ТекСтрокаСписок.ПоставщикКод);
				НоваяСтрока.ПоставщикИмя = ПреобразованиеДанныхДляОбмена("Строка",ТекСтрокаСписок.ПоставщикИмя);
			КонецЕсли;
		КонецЦикла;
		// } VIV
		
		ЗначениеОбмена.Добавить(ТЗПоставщики);
		ЗначениеОбмена.Добавить(ТЗОстатки);
		
		//таблица item-ledger
		ТЗДвижения = Новый ТаблицаЗначений;
		ТЗДвижения.Колонки.Добавить("ТипОперации", Новый ОписаниеТипов("Строка"));
		ТЗДвижения.Колонки.Добавить("ИдентификаторСкладаДилера", Новый ОписаниеТипов("Строка"));
		ТЗДвижения.Колонки.Добавить("Дата", Новый ОписаниеТипов("Строка"));
		ТЗДвижения.Колонки.Добавить("АртикулЗЧ", Новый ОписаниеТипов("Строка"));
		ТЗДвижения.Колонки.Добавить("СтоимостьЕдВРублях", Новый ОписаниеТипов("Строка"));
		ТЗДвижения.Колонки.Добавить("Количество", Новый ОписаниеТипов("Строка"));
		ТЗДвижения.Колонки.Добавить("СтоимостьИтого", Новый ОписаниеТипов("Строка"));
		ТЗДвижения.Колонки.Добавить("ПоставщикКод", Новый ОписаниеТипов("Строка"));
		ТЗДвижения.Колонки.Добавить("ЗаказНарядНомер", Новый ОписаниеТипов("Строка"));
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	""Покупка"" КАК ТипОперации,
		|	ПартииТоваровКомпанииОбороты.СкладКомпании.Код КАК Склад,
		|	ПартииТоваровКомпанииОбороты.Регистратор.Дата КАК Дата,
		|	ПартииТоваровКомпанииОбороты.Номенклатура.Артикул КАК Артикул,
		|	СУММА(ВЫБОР
		|			КОГДА ЕСТЬNULL(ПартииТоваровКомпанииОбороты.КоличествоПриход, 0) <> 0
		|				ТОГДА ЕСТЬNULL(ПартииТоваровКомпанииОбороты.СуммаПриход, 0) / ЕСТЬNULL(ПартииТоваровКомпанииОбороты.КоличествоПриход, 1)
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Цена,
		|	СУММА(ЕСТЬNULL(ПартииТоваровКомпанииОбороты.КоличествоПриход, 0)) КАК Количество,
		|	СУММА(ЕСТЬNULL(ПартииТоваровКомпанииОбороты.СуммаПриход, 0)) КАК Стоимость,
		|	ПартииТоваровКомпанииОбороты.Регистратор.Контрагент.Код КАК ПоставщикКод,
		|	"""" КАК ЗаказНарядНомер
		|ИЗ
		|	РегистрНакопления.ПартииТоваровКомпании.Обороты(
		|			&ДатаНачала,
		|			&ДатаОкончания,
		|			Регистратор,
//		|			НЕ СкладКомпании В (&Склады)
//KamikadZe begin add 28.11.2016 14:55:53
		|			СкладКомпании В (&Склады)
		|				И Номенклатура В (&ТЗНоменклатуры)) КАК ПартииТоваровКомпанииОбороты
		|ГДЕ
		|	ПартииТоваровКомпанииОбороты.Регистратор ССЫЛКА Документ.ПоступлениеТоваров
//KamikadZe begin add 10.02.2016 19:57:25
        |	И ПартииТоваровКомпанииОбороты.Регистратор.Организация = &Организация
//KamikadZe end add				   
		|
		|СГРУППИРОВАТЬ ПО
		|	ПартииТоваровКомпанииОбороты.СкладКомпании.Код,
		|	ПартииТоваровКомпанииОбороты.Номенклатура.Артикул,
		|	ПартииТоваровКомпанииОбороты.Регистратор.Контрагент.Код,
		|	ПартииТоваровКомпанииОбороты.Регистратор.Дата
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""Продажа"",
		|	ПродажиОбороты.СкладКомпании.Код,
		|	ПродажиОбороты.Регистратор.Дата,
		|	ПродажиОбороты.Номенклатура.Артикул,
		|	СУММА(ВЫБОР
		|			КОГДА ЕСТЬNULL(ПродажиОбороты.КоличествоОборот, 0) <> 0
		|				ТОГДА ЕСТЬNULL(ПродажиОбороты.СуммаОборот, 0) / ЕСТЬNULL(ПродажиОбороты.КоличествоОборот, 1)
		|			ИНАЧЕ 0
		|		КОНЕЦ),
		|	СУММА(ЕСТЬNULL(ПродажиОбороты.КоличествоОборот, 0)),
		|	СУММА(ЕСТЬNULL(ПродажиОбороты.СуммаОборот, 0)),
		|	"""",
		|	ВЫБОР
		|		КОГДА ПродажиОбороты.Регистратор ССЫЛКА Документ.ЗаказНаряд
		|			ТОГДА ПродажиОбороты.Регистратор.Номер
		|		ИНАЧЕ """"
		|	КОНЕЦ
		|ИЗ
		|	РегистрНакопления.Продажи.Обороты(
		|			&ДатаНачала,
		|			&ДатаОкончания,
		|			Регистратор,
		//|			НЕ СкладКомпании В (&Склады)
		//|				И Номенклатура В (&ТЗНоменклатуры)) КАК ПродажиОбороты
//KamikadZe begin add 28.11.2016 14:57:09
		|				Номенклатура В (&ТЗНоменклатуры)) КАК ПродажиОбороты
//KamikadZe end add
		|ГДЕ
		|	(ПродажиОбороты.Регистратор ССЫЛКА Документ.РеализацияТоваров
		|			ИЛИ ПродажиОбороты.Регистратор ССЫЛКА Документ.ЗаказНаряд
		|			ИЛИ ПродажиОбороты.Регистратор ССЫЛКА Документ.ЗакрытиеСмены)
//KamikadZe begin add 10.02.2016 19:57:45
		|	И ПродажиОбороты.Регистратор.Организация = &Организация
//KamikadZe end add				   
		|
		|СГРУППИРОВАТЬ ПО
		|	ПродажиОбороты.Номенклатура.Артикул,
		|	ВЫБОР
		|		КОГДА ПродажиОбороты.Регистратор ССЫЛКА Документ.ЗаказНаряд
		|			ТОГДА ПродажиОбороты.Регистратор.Номер
		|		ИНАЧЕ """"
		|	КОНЕЦ,
		|	ПродажиОбороты.СкладКомпании.Код,
		|	ПродажиОбороты.Регистратор.Дата
		|
		|УПОРЯДОЧИТЬ ПО
		|	Артикул
		|АВТОУПОРЯДОЧИВАНИЕ";
		
		Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(НачалоДня(ТекущаяДата())-1));
		Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(НачалоДня(ТекущаяДата())-1));
		Запрос.УстановитьПараметр("Дата", ТекущаяДата());
		Запрос.УстановитьПараметр("Склады", Склады);
		Запрос.УстановитьПараметр("ТЗНоменклатуры", ТаблицаНоменклатурыПоиска);	
	//KamikadZe begin add 10.02.2016 19:28:29
		Запрос.УстановитьПараметр("Организация", Справочники.ур_НастройкиDMS.ОсновнаяНастройка.ОрганизацияДляЗаказа);
	//KamikadZe end add
		РезультатДвижения = Запрос.Выполнить().Выгрузить();
		
		Для Каждого ТекСтрокаДвижения Из РезультатДвижения Цикл
			НоваяСтрока = ТЗДвижения.Добавить();
			НоваяСтрока.ТипОперации = ТекСтрокаДвижения.ТипОперации;
			НоваяСтрока.ИдентификаторСкладаДилера = ПреобразованиеДанныхДляОбмена("Строка",ТекСтрокаДвижения.Склад);
			НоваяСтрока.Дата = Формат(ТекСтрокаДвижения.Дата, "ДФ=yyyyMMdd");
			//НоваяСтрока.АртикулЗЧ = ПреобразованиеДанныхДляОбмена("Строка",СокрЛП(ТекСтрокаДвижения.Артикул));
			//переброска на артикул без тире
			СоответствиеАртикула=ТаблицаСоответствийАртикулов.Найти(ТекСтрокаДвижения.Артикул,"АртикулНоменклатуры");
			Если НЕ СоответствиеАртикула=Неопределено Тогда
				НоваяСтрока.АртикулЗЧ = ПреобразованиеДанныхДляОбмена("Строка",СокрЛП(СоответствиеАртикула.АртикулВКаталоге));	
			Иначе
				НоваяСтрока.АртикулЗЧ = ПреобразованиеДанныхДляОбмена("Строка",СокрЛП(ТекСтрокаДвижения.Артикул));
			КонецЕсли;
			
			НоваяСтрока.СтоимостьЕдВРублях = ПреобразованиеДанныхДляОбмена("Число",СтрЗаменить(Строка(ТекСтрокаДвижения.Цена)," ",""));
			НоваяСтрока.Количество = ПреобразованиеДанныхДляОбмена("Число",СтрЗаменить(Строка(Окр(ТекСтрокаДвижения.Количество))," ",""));
			НоваяСтрока.СтоимостьИтого = ПреобразованиеДанныхДляОбмена("Число",СтрЗаменить(Строка(ТекСтрокаДвижения.Стоимость)," ",""));
			НоваяСтрока.ЗаказНарядНомер = ПреобразованиеДанныхДляОбмена("Строка",ТекСтрокаДвижения.ЗаказНарядНомер);
			НоваяСтрока.ПоставщикКод = ПреобразованиеДанныхДляОбмена("Строка", ТекСтрокаДвижения.ПоставщикКод);
		КонецЦикла;
		
		ЗначениеОбмена.Добавить(ТЗДвижения);
		
		//++ ПП
		//таблица lost-sales//send-daily-info
		//Упущенные продажи дилера (названия файла: lost-sales)
		//           Артикул
		//            [Дата]  (формат ГГГГММДД) 
		//            [Кол-во]
		
		ТЗПП = Новый ТаблицаЗначений;
		ТЗПП.Колонки.Добавить("Артикул", Новый ОписаниеТипов("Строка"));
		ТЗПП.Колонки.Добавить("Дата", Новый ОписаниеТипов("Строка"));
		ТЗПП.Колонки.Добавить("Количество", Новый ОписаниеТипов("Строка"));
		
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
		// Данный фрагмент построен конструктором.
		// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ур_ПотерянныеПродажи.Артикул,
		|	СУММА(ур_ПотерянныеПродажи.Количество) КАК Количество
		|ИЗ
		|	РегистрСведений.ур_ПотерянныеПродажи КАК ур_ПотерянныеПродажи
		|ГДЕ
		|	ур_ПотерянныеПродажи.ДатаИВремяРегистрации МЕЖДУ &ДатаНач И &ДатаКон
		|	И ур_ПотерянныеПродажи.Номенклатура В(&ТЗНоменклатуры)
		|
		|СГРУППИРОВАТЬ ПО
		|	ур_ПотерянныеПродажи.Артикул";
		
		Запрос.УстановитьПараметр("ДатаКон", КонецДня(НачалоДня(ТекущаяДата())-1));
		Запрос.УстановитьПараметр("ДатаНач", НачалоДня(НачалоДня(ТекущаяДата())-1));
		Запрос.УстановитьПараметр("Дата", ТекущаяДата());
		Запрос.УстановитьПараметр("ТЗНоменклатуры",ТаблицаНоменклатурыПоиска);
		
		Результат = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = Результат.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			// Вставить обработку выборки ВыборкаДетальныеЗаписи
			НовСтр=ТЗПП.Добавить();
			//НовСтр.Артикул=ПреобразованиеДанныхДляОбмена("Строка", СокрЛП(ВыборкаДетальныеЗаписи.Артикул));
			//переброска на артикул без тире
			СоответствиеАртикула=ТаблицаСоответствийАртикулов.Найти(ВыборкаДетальныеЗаписи.Артикул,"АртикулНоменклатуры");
			Если НЕ СоответствиеАртикула=Неопределено Тогда
				НовСтр.Артикул = ПреобразованиеДанныхДляОбмена("Строка",СокрЛП(СоответствиеАртикула.АртикулВКаталоге));	
			Иначе
				НовСтр.Артикул = ПреобразованиеДанныхДляОбмена("Строка",СокрЛП(ВыборкаДетальныеЗаписи.Артикул));
			КонецЕсли;
			
			
			НовСтр.Количество=ПреобразованиеДанныхДляОбмена("Число",СтрЗаменить(Строка(Окр(ВыборкаДетальныеЗаписи.Количество))," ",""));
			НовСтр.Дата=Формат(ТекущаяДата(), "ДФ=yyyyMMdd");
		КонецЦикла;
		
		ЗначениеОбмена.Добавить(ТЗПП);
		
		//++статистика машинозаездов
		ТЗМШ = Новый ТаблицаЗначений;
		ТЗМШ.Колонки.Добавить("VIN", Новый ОписаниеТипов("Строка"));
		ТЗМШ.Колонки.Добавить("Дата", Новый ОписаниеТипов("Строка"));
		
		//список синонимов
		НастройкиБренда=Справочники.ур_НастройкиDMS.НайтиПоРеквизиту("Бренд",ТекБренд);
		СписокСинонимов=НастройкиБренда.НаименованияБренда;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказНаряд.Автомобиль.VIN,
		|	ЗаказНаряд.Автомобиль.Наименование
		|ИЗ
		|	Документ.ЗаказНаряд КАК ЗаказНаряд
		|ГДЕ
		|	ЗаказНаряд.ДатаОкончания МЕЖДУ &ДатаНач И &ДатаКон
		|	И ЗаказНаряд.Проведен = ИСТИНА";
		
		Запрос.УстановитьПараметр("ДатаКон", КонецДня(НачалоДня(ТекущаяДата())-1));
		Запрос.УстановитьПараметр("ДатаНач", НачалоДня(НачалоДня(ТекущаяДата())-1));
		
		Результат = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = Результат.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			//проверка на бренд
			СоответствуетБренду=Ложь;
			Для Каждого ТекСиноним Из СписокСинонимов Цикл
				Если СтрЧислоВхождений(СокрЛП(ВРег(ВыборкаДетальныеЗаписи.Наименование)),СокрЛП(ВРег(ТекСиноним)))=0 Тогда
					Продолжить;
				Иначе 
					СоответствуетБренду=Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если СоответствуетБренду Тогда
				НовСтр=ТЗПП.Добавить();
				НовСтр.VIN=ВыборкаДетальныеЗаписи.VIN;
				НовСтр.Дата=Формат(КонецДня(НачалоДня(ТекущаяДата())-1), "ДФ=yyyyMMdd");
			КонецЕсли;
		КонецЦикла;
		
		
		ЗначениеОбмена.Добавить(ТЗМШ);
		
		Возврат ЗначениеОбмена;
		
	КонецФункции	
	
	Процедура ур_ВыгрузитьСтатистическиеДанные(Параметры = Неопределено) Экспорт
		Попытка
			Если Найти(СтрокаСоединенияИнформационнойБазы(),""""+обПолучитьЗначениеСвойства(Справочники.Организации.ОсновнаяОрганизация,"ИмяБазы","$")+"""")=0 Тогда 
				Возврат;
			КонецЕсли;
		Исключение
		КонецПопытки;
		
		Выборка=Справочники.ур_БрендыСиУС.Выбрать();	 //последоветальное получение адресов по брендам дилера
		Пока Выборка.Следующий() Цикл
			ТекБренд=Выборка.Ссылка;
			Настройка=Справочники.ур_НастройкиDMS.НайтиПоРеквизиту("Бренд",ТекБренд);
			Если НЕ Настройка.НастройкаАктивна Тогда Продолжить; КонецЕсли;
			ЗначенияОбмена = ур_СтатистическиеДанные(ТекБренд);
			Данные=ур_ОтправкаПолучениеДанных("send-item-ledger",ЗначенияОбмена,ТекБренд);	
			Данные=ур_ОтправкаПолучениеДанных("send-ledger-veh",ЗначенияОбмена,ТекБренд);	
		    ЗаписьЖурналаРегистрации("СиУС", УровеньЖурналаРегистрации.Информация, , , "ур_ВыгрузитьСтатистическиеДанные завершена "+ТекБренд);
		КонецЦикла;
		
	КонецПроцедуры
	
	// VIV. 19.08.2013 9:24:57
	//
	Процедура ОбновитьАдресаДилера() Экспорт
		
		Выборка=Справочники.ур_БрендыСиУС.Выбрать();	 //последоветальное получение адресов по брендам дилера
		Пока Выборка.Следующий() Цикл
			ТекБренд=Выборка.Ссылка;
			Настройка=Справочники.ур_НастройкиDMS.НайтиПоРеквизиту("Бренд",ТекБренд);
			Если НЕ Настройка.НастройкаАктивна Тогда Продолжить; КонецЕсли;
			
			Данные=ур_ОтправкаПолучениеДанных("get-ship-to-address",,ТекБренд);
			Если Найти(Данные,"ошибка обмена")=0 И Найти(Данные,"SQL Server")=0 Тогда
				//Элемент=Справочники.ур_АдресаДилера.ОсновнойДилер.ПолучитьОбъект();
				Элемент=Справочники.ур_АдресаДилера.НайтиПоРеквизиту("Бренд",ТекБренд);
				Если Элемент=Справочники.ур_АдресаДилера.ПустаяСсылка() Тогда
					Элемент=Справочники.ур_АдресаДилера.СоздатьЭлемент();
					Элемент.Наименование="Адреса бренда "+ТекБренд.Наименование;
					Элемент.Бренд=ТекБренд;
				Иначе
					Элемент=Элемент.Ссылка.ПолучитьОбъект();
				КонецЕсли;
				КоличествоСтрок=СтрЧислоСтрок(Данные);
				Для Стр=1 По КоличествоСтрок Цикл
					
					СтрокаАдрес=СтрПолучитьСтроку(Данные, Стр);
					Разделитель=Найти(СтрокаАдрес, ";");
					КодАдреса=Сред(СтрокаАдрес, 1, Разделитель-1);
					СтрокаАдрес=Сред(СтрокаАдрес, Разделитель+1);
					
					НайденныеСтроки = Элемент.Адреса.Найти(КодАдреса, "Код");
					Если НайденныеСтроки=Неопределено Тогда
						НоваяСтрока=Элемент.Адреса.Добавить();
					иначе
						НоваяСтрока=НайденныеСтроки;
					КонецЕсли;
					
					НоваяСтрока.АдресПоставки=СтрокаАдрес;
					НоваяСтрока.Код=КодАдреса;
					
				КонецЦикла;
				
				Элемент.Записать();
				
			КонецЕсли;
		КонецЦикла; 
	КонецПроцедуры 
	
	
	Процедура ур_ПолучитьАдресаДилера(Параметры = Неопределено) Экспорт
		ОбновитьАдресаДилера();
	    ЗаписьЖурналаРегистрации("СиУС", УровеньЖурналаРегистрации.Информация, , , "ур_ПолучитьАдресаДилера завершена");
	КонецПроцедуры
	
	Процедура ПолучитьТипыЗаказов();
		Выборка=Справочники.ур_БрендыСиУС.Выбрать();	 //последоветальное получение адресов по брендам дилера
		Пока Выборка.Следующий() Цикл
			ТекБренд=Выборка.Ссылка;
			Настройка=Справочники.ур_НастройкиDMS.НайтиПоРеквизиту("Бренд",ТекБренд);
			Если НЕ Настройка.НастройкаАктивна Тогда Продолжить; КонецЕсли;
			
			Данные=ур_ОтправкаПолучениеДанных("get-shipment-method",,ТекБренд);
			Если Найти(Данные,"ошибка обмена")=0 И Найти(Данные,"SQL Server")=0 Тогда
				//Элемент=Справочники.ур_АдресаДилера.ОсновнойДилер.ПолучитьОбъект();
				Элемент=Справочники.ур_ТипыЗаказов.НайтиПоРеквизиту("Бренд",ТекБренд);
				Если Элемент=Справочники.ур_ТипыЗаказов.ПустаяСсылка() Тогда
					Элемент=Справочники.ур_ТипыЗаказов.СоздатьЭлемент();
					Элемент.Наименование="Типы заказа для бренда "+ТекБренд.Наименование;
					Элемент.Бренд=ТекБренд;
				Иначе
					Элемент=Элемент.Ссылка.ПолучитьОбъект();
					Для Каждого ТекТипЗаказа ИЗ Элемент.ТипыЗаказов Цикл
						ТекТипЗаказа.ТипАктивен=Ложь;
					КонецЦикла;
				КонецЕсли;
				КоличествоСтрок=СтрЧислоСтрок(Данные);
				Для Стр=1 По КоличествоСтрок Цикл
					
					СтрокаАдрес=СтрПолучитьСтроку(Данные, Стр);
					Разделитель=Найти(СтрокаАдрес, ";");
					КодАдреса=Сред(СтрокаАдрес, 1, Разделитель-1);
					СтрокаАдрес=Сред(СтрокаАдрес, Разделитель+1);
					
					НайденныеСтроки = Элемент.ТипыЗаказов.Найти(КодАдреса, "Код");
					Если НайденныеСтроки=Неопределено Тогда
						НоваяСтрока=Элемент.ТипыЗаказов.Добавить();
					иначе
						НоваяСтрока=НайденныеСтроки;
					КонецЕсли;
					
					НоваяСтрока.ТипЗаказа=КодАдреса;
					НоваяСтрока.Код=СтрокаАдрес;
					НоваяСтрока.ТипАктивен=Истина;
					
				КонецЦикла;
				
				Элемент.Записать();
				
			КонецЕсли;
		КонецЦикла; 
	КонецПроцедуры 

	Процедура ур_ПолучитьТипыЗаказов(Параметры = Неопределено) Экспорт
		ПолучитьТипыЗаказов();
	КонецПроцедуры
